models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/P150x2/optimized_vllm/before/vllm_benchmark.log
INFO 09-08 19:32:48 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-08 19:32:48 [__init__.py:46] - tt -> vllm_tt_plugin.entrypoints:platform_plugin
INFO 09-08 19:32:48 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
2026-09-08 19:32:49.585 | DEBUG    | ttnn:<module>:45 - Initial ttnn.CONFIG:
Config{cache_path=/home/hous/.cache/ttnn,model_cache_path=/home/hous/.cache/ttnn/models,tmp_dir=/tmp/ttnn,enable_model_cache=false,enable_fast_runtime_mode=true,validate_program_args=false,throw_exception_on_fallback=true,enable_logging=false,enable_graph_report=false,enable_graph_python_stack_traces=false,enable_detailed_buffer_report=false,enable_detailed_tensor_report=false,enable_comparison_mode=false,comparison_mode_should_raise_exception=false,comparison_mode_pcc=0.9999,root_report_path=generated/ttnn/reports,report_name=std::nullopt,std::nullopt}
INFO 09-08 19:32:49 [__init__.py:253] Platform plugin tt is activated

################################################################################
#                                                                              #
#        **************************************************************        #
#                                                                              #
#                             D E P R E C A T E D                              #
#                                                                              #
#        **************************************************************        #
#                                                                              #
#          This vLLM fork (tenstorrent/vllm) is no longer maintained.          #
#         Tenstorrent support now ships as a plugin for UPSTREAM vLLM:         #
#                                                                              #
#          >>>   https://github.com/tenstorrent/vllm-tt-plugin   <<<           #
#                                                                              #
#      No further fixes, model enablement, or upstream merges land here,       #
#     and this repository will be archived. Migrate now: install upstream      #
#        vLLM plus vllm-tt-plugin, following that repository's README.         #
#                File issues and pull requests there, not here.                #
#                                                                              #
################################################################################

INFO 09-08 19:32:52 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 19:32:52 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76b677eb0540>, trust_remote_code=False, seed=0, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='google/gemma-4-26B-A4B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/hous/dev/tt-metal/models/autoports/google_gemma_4_26b_a4b_it/readiness_vllm/optimized_vllm/before/P150x2/vllm_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-54a0525a-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 09-08 19:32:54 [datasets.py:607] Sampling input_len from [128, 128] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 1/1 [00:03<00:00,  3.23s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1         
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  3.23      
Total input tokens:                      128       
Total generated tokens:                  128       
Request throughput (req/s):              0.31      
Output token throughput (tok/s):         39.57     
Peak output token throughput (tok/s):    47.00     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          79.14     
---------------Time to First Token----------------
Mean TTFT (ms):                          264.74    
Median TTFT (ms):                        264.74    
P99 TTFT (ms):                           264.74    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.39     
Median TPOT (ms):                        23.39     
P99 TPOT (ms):                           23.39     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.39     
Median ITL (ms):                         21.49     
P99 ITL (ms):                            25.29     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3234.66   
Median E2EL (ms):                        3234.66   
P99 E2EL (ms):                           3234.66   
==================================================
nanobind: leaked 102 instances!
 - leaked instance 0x76b68937cca8 of type "ttnn._ttnn.operations.experimental.IndexerScoreProgramConfig"
 - leaked instance 0x39ad5c10 of type "ttnn._ttnn.operations.unary.identity_t"
 - leaked instance 0x397b1100 of type "ttnn._ttnn.operations.unary.sin_t"
 - leaked instance 0x39f73e20 of type "ttnn._ttnn.operations.unary.deg2rad_t"
 - leaked instance 0x39d850a0 of type "ttnn._ttnn.operations.unary.isinf_t"
 - leaked instance 0x39634e00 of type "ttnn._ttnn.operations.unary.gtz_t"
 - leaked instance 0x396c8330 of type "ttnn._ttnn.operations.unary.silu_t"
 - leaked instance 0x76b6dcc6d9e8 of type "ttnn._ttnn.multi_device.MeshCoordinate"
 - leaked instance 0x76b6894559a8 of type "ttnn._ttnn.operations.normalization.SoftmaxDefaultProgramConfig"
 - leaked instance 0x3a1e2b60 of type "ttnn._ttnn.operations.unary.sigmoid_accurate_t"
 - leaked instance 0x76b689560b88 of type "ttnn._ttnn.multi_device.MeshCoordinate"
 - leaked instance 0x39f01ff0 of type "ttnn._ttnn.operations.unary.multigammaln_t"
 - leaked instance 0x3a1625f0 of type "ttnn._ttnn.operations.unary.triu_t"
 - leaked instance 0x37aafc10 of type "ttnn._ttnn.operations.unary.erfinv_t"
 - leaked instance 0x76b6dcc6d808 of type "ttnn._ttnn.multi_device.MeshCoordinate"
 - leaked instance 0x76b689457268 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x76b6894578a8 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x3a1e5490 of type "ttnn._ttnn.operations.unary.log1p_t"
 - leaked instance 0x76b68948b678 of type "ttnn._ttnn.tensor.CoreCoord"
 - leaked instance 0x39eb90f0 of type "ttnn._ttnn.operations.unary.log10_t"
 - ... skipped remainder
nanobind: leaked 984 types!
 - leaked type "SocketEndpoint"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.gt__t"
 - leaked type "ttnn._ttnn.operations.experimental.attn_res_gather_softmax_t"
 - leaked type "ttnn._ttnn.d2d_stream_service.D2DStreamServiceSender"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.SliceDeviceOperation"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.MatmulMultiCoreReuseMultiCastBatchedDRAMShardedProgramConfig"
 - leaked type "ttnn._ttnn.operations.binary.lt__t"
 - leaked type "ttnn._ttnn.operations.binary_backward.xlogy_bw_t"
 - leaked type "ttnn._ttnn.operations.experimental.insert_t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.isclose_t"
 - ... skipped remainder
nanobind: leaked 4503 functions!
 - leaked function ""
 - leaked function "__call__"
 - leaked function ""
 - leaked function ""
 - leaked function "__call__"
 - leaked function "__call__"
 - leaked function ""
 - leaked function "__call__"
 - leaked function ""
 - leaked function ""
 - ... skipped remainder
nanobind: this is likely caused by a reference counting issue in the binding code.
See https://nanobind.readthedocs.io/en/latest/refleaks.html